README updated && md files added
